# -*- coding: UTF-8 -*-

#===============================================================================
# Author: 骛之
# Contact: ouds@gaiding.com
# Project: Game
# File Name: ouds/common/consts.py
# Revision: 0.1
# Date: 2008-10-07 21:35
# Description: constants.
#===============================================================================

from django.utils.translation import ugettext_lazy as _

PER_PAGE = 25 # 分页量
INCREMENT = 9 # 等级量变增量

# 地图
#MIN_LONGITUDE = -2000
#MAX_LONGITUDE = -781
#MIN_LATITUDE = -2000
#MAX_LATITUDE = 2000
MIN_LONGITUDE = -988
MAX_LONGITUDE = -888
MIN_LATITUDE = -50
MAX_LATITUDE = 50

MARGIN_ROWS = 4
MARGIN_COLUMNS = 4

COORDINATE_PROPERTY = (
        # 自然地形
        (0, _(u'水域')),
        (1, _(u'湿地')),
        (2, _(u'平原')),
        (3, _(u'山地')),
        (4, _(u'关隘')),
        (5, _(u'森林')),
        (6, _(u'草原')),
        (7, _(u'沙漠')),
        # 人工地形
        (8, _(u'道路')),
        (9, _(u'运河')),
        (10, _(u'桥梁')),
        (11, _(u'防御带')),
       )

# 会员
VIP_TYPE = (
        (5, _(u'黄金帐号')),
        (3, _(u'白银帐号')),
        (1, _(u'青铜帐号')),
       )

MEMBER_TYPE = (
        (0, _(u'文')),
        (1, _(u'武')),
       )

SEX_TYPE = (
        (u'female', _(u'女')),
        (u'male', _(u'男')),
        (u'unknown', _(u'保密')),
       )

USER_AREA = (
        (u'cn', _(u'中国大陆')),
        (u'tw', _(u'中国台湾')),
        (u'hk', _(u'中国香港')),
        (u'mc', _(u'中国澳门')),
        (u'us', _(u'美国')),
       )

BUG_LEVEL = (
        (0, _(u'特级')),
        (1, _(u'一级')),
        (2, _(u'二级')),
        (3, _(u'三级')),
       )

MESSAGE_FOLDER = (
        (0, _(u'收件箱')),
        (1, _(u'发件箱')),
        (2, _(u'垃圾箱')),
        (3, _(u'档案室')),
       )

MESSAGE_TYPE = (
        (0, _(u'公告声明')),
        (1, _(u'联盟消息')),
        (2, _(u'私人联系')),
        (3, _(u'侠客报告')),
       )

MESSAGE_STATUS = (
        (0, _(u'未读')),
        (1, _(u'未读删除')),
        (2, _(u'已读')),
        (3, _(u'已读回复')),
        (4, _(u'已读删除')),
       )

# 城市
CITY_ERA = (
        (u'forest', _(u'丛林时代')),
        (u'fire', _(u'拜火时代')),        
        (u'stone', _(u'石器时代')),
        (u'primal', _(u'原始社会')),
        (u'nomad', _(u'游牧时代')),
        (u'bronze', _(u'青铜时代')),
        (u'agri', _(u'农业时代')),
        (u'iron', _(u'铁器时代')),
        (u'feudal', _(u'封建社会')),
        (u'silver', _(u'白银时代')),
        (u'sea', _(u'大航海时代')),
        (u'gold', _(u'黄金时代')),
        (u'info', _(u'信息时代')),
       )

CITY_STATUS = (
        (0, _(u'和平发展')),
        (1, _(u'暴动叛乱')),
        (2, _(u'有敌攻来')),
        (3, _(u'交战之中')),
       )

JIE_QI = (
        (2, 6, _(u'立春')),
        (2, 21, _(u'雨水')),
        (3, 6, _(u'惊蛰')),
        (3, 21, _(u'春分')),
        (4, 6, _(u'清明')),
        (4, 21, _(u'谷雨')),
        (5, 6, _(u'立夏')),
        (5, 21, _(u'小满')),
        (6, 6, _(u'芒种')),
        (6, 21, _(u'夏至')),
        (7, 8, _(u'小暑')),
        (7, 23, _(u'大暑')),
        (8, 8, _(u'立秋')),
        (8, 23, _(u'处暑')),
        (9, 8, _(u'白露')),
        (9, 23, _(u'秋分')),
        (10, 8, _(u'寒露')),
        (10, 23, _(u'霜降')),
        (11, 8, _(u'立冬')),
        (11, 23, _(u'小雪')),
        (12, 8, _(u'大雪')),
        (12, 23, _(u'冬至')),
        (1, 6, _(u'小寒')),
        (1, 21, _(u'大寒')),
       )

SEASON_TYPE = (
        (u'spring', _(u'春季')),
        (u'summer', _(u'夏季')),
        (u'autumn', _(u'秋季')),
        (u'winter', _(u'冬季')),
       )

CATASTROPHE_TYPE = (
        (0, _(u'风调雨顺')),
        (1, _(u'雪灾')),
        (2, _(u'地震')),
        (3, _(u'冰灾')),
       )

